# Store all constants used by the data loader module
# =============================================================================

CONVERSION_TABLE = {
    '‐': '-', '–': '-', '−': '-',
    '─': '-', '◆': '・', '○': '・', '♦': '・', '、': ',',
    '―': 'ー',       # 'ー': '-' (actual kata)
    '—': '-', '“': '"', '”': '"', '〜': '~',
    '。': '.', '〈': '(', '〉': ')', '《': '(', '》': ')', '〔': '(',
    '〕': ')',
    '‘': "'", '’': "'", '′': "'", "〃": '"', '　': ' ',
    '×': 'x', 'ɡ': 'g', 'Α': 'A', 'Χ': 'X',
    'Ε': 'E', 'Ζ': 'Z', 'А': 'A', 'М': 'M', 'Н': 'H', 'О': 'O', 'Т': 'T',
    'а': 'a', 'е': 'e', 'о': 'o', 'р': 'p', 'с': 'c', 'н': 'H',
    'コト': 'ヿ',

    '゛': '゙', ' ゙': '゙',        # handakuten
    '゜': '゚', ' ゚': '゚',        # dakuten

    # Maths
    '⊿': 'Δ', '△': 'Δ', '▵': 'Δ', '⇒': '→',

    # Only for Japanese purpose
    'á': 'a', 'ä': 'a', 'é': 'e', 'ö': 'o', 'ü': 'u', 'и': 'n',

    # REMOVE
    '´': '', ' ́': '', '\u0000': '',
}

TOP_CHARS = {'°', "'", '"'}
MIDDLE_CHARS = {'+', '-', '=', '・', '一', '~'}
BOTTOM_CHARS = set('qypgj,')

NUMBERS = set('0123456789')

NOT_RESIZE = {'-', '一', '.'}

SMALL_CHARS = {'.', ',', '・', '°', "'", '"'}     # keep very small around max 0.3
MEDIUM_CHARS = {'+', '=', '~'}          # 0.3 - 0.5
SMALL_LATIN = set('weruioaszxcvnm&@')     # 0.6 - 0.75
SMALL_KATA_HIRA = set(
    'ァィゥェォヵヶッャュョ' + 'ぁぃぅぇぉゕゖっゃゅょゎ') # 0.5-0.7
NORMAL_FORCE_SMALLER = set(             # 0.7 - 0.75
    'ハバパムロコゴニ' +                # kata
    '二'                             # kanji
)
KATA_HIRA = set(        # 0.75 - 0.9 normal size
    'あいうゔえおかがきぎくぐけげこごさざしじすずせぜそぞただちぢつづてでとどなにぬねのは'
    'ばぱひびぴふぶぷへべぺほぼぽまみむめもやゆよらりるれろわゐゑをんーゝゞゟ' +
    'アイウヴエオカガキギクグケゲサザシジスズセゼソゾタダチヂツヅテデトドナヌネノ'
    'ヒビピフブプヘベペホボポマミメモヤユヨラリルレワヰヱヲンーヽヾ' # remove ニ
)

DAKUTEN = '゙'
HANDAKUTEN = '゚'

INVALID_KATAS = set('ヷヸヹヺ・ーヽヾヿヰヱヴ゠')
INVALID_HIGAS = set('ゝゞゟゐゑゔ')

TRAIN_MODE = 1
TEST_MODE = 2
VALIDATION_MODE = 3
INFER_MODE = 4
